// -------------------------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------------------------//
//  DANNY JOSE JIMENEZ GUTIERREZ   
//  TELEFONO :0424-281-44-55
//  CORREO : DENNALY88@GMAIL.COM
//  INGENIERO EN SISTEMAS 
//--------------------------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------------------------//	
//  CUA , ESTADO MIRANDA 2025
//  CURSO DE ALGORITMO Y PSEUDOCODIGO 
//  APLICACIÓN PARA CORRER LOS EJERCICIOS ES PSEINT 
//  DEV DEVELOPMENT    
// -------------------------------------------------------------------------------------------------------------------//

//--------------------------------------------------------------------------------------------------------------------//
// Ejercicio Nº 7 - basico. Hallar el perímetro de un cuadrado y mostrar el resultado por pantalla                    //
//--------------------------------------------------------------------------------------------------------------------//

	Algoritmo Ejercicio_7
				
				Definir Calculo Como Entero
				Definir Lado Como Entero
				Definir Cuadrado Como Entero
				
				Cuadrado = 4 ;
				
				
				Escribir ();
				Escribir "*****************************************************";
				Escribir "PROGRAMA PARA CALCULAR EL PERIMETRO DE UN CUADRADO " ;
				Escribir "******************************************************";
				
				
				Escribir "INTRODUCE CUANTO MIDE LOS LADOS , SE SABE QUE LOS CUATROS LADOS MIDEN IGUAL" ;
				Leer Lado;
				Escribir ();
				
				
				Calculo = (Cuadrado * Lado) 
				
				Escribir "*****************************************************************";
				Escribir "EL PERIMETRO DE UN CUADRADO ES       : "  , Calculo;
				Escribir "******************************************************************";
				
				Escribir ();
				Escribir ();
				
FinAlgoritmo


// -------------------------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------------------------//
//  DANNY JOSE JIMENEZ GUTIERREZ   
//  TELEFONO :0424-281-44-55
//  CORREO : DENNALY88@GMAIL.COM
//  INGENIERO EN SISTEMAS 
//--------------------------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------------------------//	
//  CUA , ESTADO MIRANDA 2025
//  CURSO DE ALGORITMO Y PSEUDOCODIGO 
//  APLICACIÓN PARA CORRER LOS EJERCICIOS ES PSEINT 
//  DEV DEVELOPMENT    
// -------------------------------------------------------------------------------------------------------------------//


